---
title: VertexPair
classe: Autodesk.Revit.DB.VertexPair
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# VertexPair

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 First { get; set; }` | `vertexPair.First` | Int32 |
| `Boolean IsValidObject { get; }` | `vertexPair.IsValidObject` | Boolean |
| `Int32 Second { get; set; }` | `vertexPair.Second` | Int32 |
| `Void Dispose()` | `vertexPair.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```